##  Assignment 

When working with data, you may not need all of the variables in your dataset. Square brackets (`[]`) can be used to select only the columns that matter to you in an order that makes sense to you.
To select only `"col_a"` of the DataFrame `df`, use

```
df["col_a"]

```

To select `"col_a"` and `"col_b"` of `df`, use

```
df[["col_a", "col_b"]]

```

In [1]:
import pandas as pd

In [2]:
homelessness = pd.read_csv("homelessness.csv")

In [3]:
homelessness.head()

,Unnamed: 0,region,state,individuals,family_members,state_pop
0,0,East South Central,Alabama,2570.0,864.0,4887681
1,1,Pacific,Alaska,1434.0,582.0,735139
2,2,Mountain,Arizona,7259.0,2606.0,7158024
3,3,West South Central,Arkansas,2280.0,432.0,3009733
4,4,Pacific,California,109008.0,20964.0,39461588

##  Instructions 

- Create a DataFrame called `individuals` that contains only the `individuals` column of `homelessness`.
- Print the head of the result.



```
# Select the individuals column
individuals = ____

# Print the head of the result
```

In [4]:
individuals = homelessness["individuals"]

In [7]:
individuals.head()

0      2570.0
1      1434.0
2      7259.0
3      2280.0
4    109008.0
Name: individuals, dtype: float64

##  Instructions 

- Create a DataFrame called `state_fam` that contains only the `state` and `family_members` columns of `homelessness`, in that order.
- Print the head of the result.



```
# Select the state and family_members columns
state_fam = ____

# Print the head of the result

In [8]:
state_fam = homelessness[["state", "family_members"]]

In [9]:
state_fam.head()

        state  family_members
0     Alabama           864.0
1      Alaska           582.0
2     Arizona          2606.0
3    Arkansas           432.0
4  California         20964.0

##  Instructions 

- Create a DataFrame called `ind_state` that contains the `individuals` and `state` columns of `homelessness`, in that order.
- Print the head of the result.



```
# Select only the individuals and state columns, in that order
ind_state = ____

# Print the head of the result

In [10]:
ind_state = homelessness[["individuals", "state"]]

In [11]:
ind_state.head()

   individuals       state
0       2570.0     Alabama
1       1434.0      Alaska
2       7259.0     Arizona
3       2280.0    Arkansas
4     109008.0  California